Revit 2024 API
SweptBlend.PathSketch Property
The sketched path for the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Sketch PathSketch { get; }
Visual Basic
Public ReadOnly Property PathSketch As Sketch
	Get
Visual C++
public:
property Sketch^ PathSketch {
	Sketch^ get ();
}
Remarks
If the swept blend is based on selected 3d curve, this property is null.
See Also
SweptBlend Class
Autodesk.Revit.DB Namespace